
## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/97293)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
  * aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-03-21T17:58:36Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "gep1rd" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1711043872987" -> "1711050959955"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "gep1rd" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476 will be updated in-place
  ~ resource "aws_lambda_function" "apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_EC760476" {
        id                             = "SendGridData-Prod-ApiGateway-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:81" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:81/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "81" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                           = (sensitive value) -> null
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_lambda_codedeploy_app_8D5BAA1D   = "SendGridData-Prod-ApiGateway-Lambda"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda-code-deploy_lambda_codedeploy_group_1DA0D0EE = "SendGridData-Prod-ApiGateway-Lambda"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda_arn_02ED2922                                 = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda_function_name_5C62E143                       = "SendGridData-Prod-ApiGateway-Function"
  + apigateway-lambda_sendgrid-data-apigateway-lambda_events-lambda_lambda_version_arn_90AEC363                         = "arn:aws:lambda:us-east-1:996905175585:function:SendGridData-Prod-ApiGateway-Function:DEPLOYED"
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"f802fce2-ba9f-4c74-b25a-51a2875e75e9","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":329,"Program":"tfcmt","SHA1":"63ab645f13cf50a53b56a8235344fc45f0b9c23b","Target":"sendgrid-data-cdk","Vars":{}} -->